{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 136,
   "id": "538a2082-4086-4c46-8e04-4dba0d1c3a17",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from tqdm import tqdm\n",
    "from neo4j import GraphDatabase\n",
    "import os\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()\n",
    "uri = os.getenv('uri')\n",
    "user = os.getenv('user')\n",
    "password = os.getenv('password')\n",
    "\n",
    "driver= GraphDatabase.driver(uri, auth=(user, password))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5f506d14",
   "metadata": {},
   "source": [
    "### Loading ESCO datasets"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 143,
   "id": "48e4641d-c5fb-4f1f-9a9d-792060593309",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>OCCUPATIONTYPE</th>\n",
       "      <th>OCCUPATIONID</th>\n",
       "      <th>RELATIONTYPE</th>\n",
       "      <th>SKILLID</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>29581</th>\n",
       "      <td>escooccupation</td>\n",
       "      <td>key_15911</td>\n",
       "      <td>essential</td>\n",
       "      <td>key_7329</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33174</th>\n",
       "      <td>escooccupation</td>\n",
       "      <td>key_16007</td>\n",
       "      <td>essential</td>\n",
       "      <td>key_5809</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47087</th>\n",
       "      <td>escooccupation</td>\n",
       "      <td>key_16318</td>\n",
       "      <td>essential</td>\n",
       "      <td>key_4428</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49047</th>\n",
       "      <td>escooccupation</td>\n",
       "      <td>key_16360</td>\n",
       "      <td>optional</td>\n",
       "      <td>key_1951</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62530</th>\n",
       "      <td>escooccupation</td>\n",
       "      <td>key_16690</td>\n",
       "      <td>optional</td>\n",
       "      <td>key_3388</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       OCCUPATIONTYPE OCCUPATIONID RELATIONTYPE   SKILLID\n",
       "29581  escooccupation    key_15911    essential  key_7329\n",
       "33174  escooccupation    key_16007    essential  key_5809\n",
       "47087  escooccupation    key_16318    essential  key_4428\n",
       "49047  escooccupation    key_16360     optional  key_1951\n",
       "62530  escooccupation    key_16690     optional  key_3388"
      ]
     },
     "execution_count": 143,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "occupations = pd.read_csv('ESCO_data/occupations.csv',dtype=str).fillna('').map(lambda x:x.lower())\n",
    "isco_groups = pd.read_csv('ESCO_data/ISCOGroups.csv',dtype=str).fillna('').map(lambda x:x.lower())\n",
    "occupations_hierarchy = pd.read_csv('ESCO_data/occupations_hierarchy.csv',dtype=str).fillna('').map(lambda x:x.lower())\n",
    "skills_data = pd.read_csv('ESCO_data/skills.csv',dtype=str).fillna('').map(lambda x:x.lower())\n",
    "skills_occupations_data = pd.read_csv('ESCO_data/occupation_skill_relations.csv',dtype=str).fillna('').map(lambda x:x.lower())\n",
    "\n",
    "skills_occupations_data.sample(5)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2dffb37d-e55d-4a95-ae65-4835c7957ef3",
   "metadata": {},
   "source": [
    "## Ingesting data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "5c722986-15aa-457b-82d3-49921404a3d4",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from tqdm import tqdm\n",
    "\n",
    "class Neo4jHandler:\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "    def close(self):\n",
    "        self.driver.close()\n",
    "\n",
    "    def run_query(self, query):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.run(query)\n",
    "            return [record.data() for record in result]\n",
    "\n",
    "    def create_occupation_nodes(self, df):\n",
    "        failed_rows = []\n",
    "        for _, row in tqdm(df.iterrows()):\n",
    "            try:\n",
    "                query = f\"\"\"\n",
    "                MERGE (c:Occupation {{key_id: '{row['ID']}'}})  \n",
    "                ON CREATE SET \n",
    "                  c.occupation_name = \"{row['PREFERREDLABEL']}\",\n",
    "                  c.origin_url = coalesce('{row['ORIGINURI']}', \"\"),\n",
    "                  c.code = coalesce('{row['CODE']}', \"\"),\n",
    "                  c.description = coalesce(\"{row['DESCRIPTION'].replace('\"','')}\", \"\")\n",
    "                \"\"\"\n",
    "                self.run_query(query)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed to process row: {row}, Error: {e}\")\n",
    "                failed_rows.append(row)\n",
    "        return failed_rows\n",
    "\n",
    "    def create_isco_group_nodes(self, df):\n",
    "        failed_rows = []\n",
    "        for _, row in tqdm(df.iterrows()):\n",
    "            try:\n",
    "                query = f\"\"\"\n",
    "                MERGE (c:ISCO_group {{key_id: '{row['ID']}'}})  \n",
    "                ON CREATE SET \n",
    "                  c.occupation_name = \"{row['PREFERREDLABEL']}\",\n",
    "                  c.origin_url = coalesce('{row['ORIGINURI']}', \"\"),\n",
    "                  c.code = coalesce('{row['CODE']}', \"\"),\n",
    "                  c.description = coalesce(\"{row['DESCRIPTION'].replace('\"','')}\", \"\")\n",
    "                \"\"\"\n",
    "                self.run_query(query)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed to process row: {row}, Error: {e}\")\n",
    "                failed_rows.append(row)\n",
    "        return failed_rows\n",
    "\n",
    "    def create_isco_hierarchy(self, df):\n",
    "        failed_rows = []\n",
    "        for _, row in tqdm(df.iterrows()):\n",
    "            try:\n",
    "                query = f\"\"\"\n",
    "                MATCH (a:ISCO_group {{key_id: '{row['PARENTID']}'}}), (b:ISCO_group {{key_id: '{row['CHILDID']}'}})\n",
    "                MERGE (a)<-[r:HAS_PARENT_OCCUPATION]-(b)\n",
    "                \"\"\"\n",
    "                self.run_query(query)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed to process row: {row}, Error: {e}\")\n",
    "                failed_rows.append(row)\n",
    "        return failed_rows\n",
    "\n",
    "    def create_occupation_isco_hierarchy(self, df):\n",
    "        failed_rows = []\n",
    "        for _, row in tqdm(df.iterrows()):\n",
    "            try:\n",
    "                query = f\"\"\"\n",
    "                MATCH (a:ISCO_group {{key_id: '{row['PARENTID']}'}}), (b:Occupation {{key_id: '{row['CHILDID']}'}})\n",
    "                MERGE (a)<-[r:HAS_PARENT_OCCUPATION]-(b)\n",
    "                \"\"\"\n",
    "                self.run_query(query)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed to process row: {row}, Error: {e}\")\n",
    "                failed_rows.append(row)\n",
    "        return failed_rows\n",
    "\n",
    "    def create_occupation_hierarchy(self, df):\n",
    "        failed_rows = []\n",
    "        for _, row in tqdm(df.iterrows()):\n",
    "            try:\n",
    "                query = f\"\"\"\n",
    "                MATCH (a:Occupation {{key_id: '{row['PARENTID']}'}}), (b:Occupation {{key_id: '{row['CHILDID']}'}})\n",
    "                MERGE (a)<-[r:HAS_PARENT_OCCUPATION]-(b)\n",
    "                \"\"\"\n",
    "                self.run_query(query)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed to process row: {row}, Error: {e}\")\n",
    "                failed_rows.append(row)\n",
    "        return failed_rows\n",
    "\n",
    "    def create_skill_nodes(self, df):\n",
    "        failed_rows = []\n",
    "        for _, row in tqdm(df.iterrows()):\n",
    "            try:\n",
    "                query = f\"\"\"\n",
    "                MERGE (c:Skill {{key_id: '{row['ID']}'}})  \n",
    "                ON CREATE SET \n",
    "                  c.skill_name = \"{row['PREFERREDLABEL']}\",\n",
    "                  c.origin_url = coalesce('{row['ORIGINURI']}', \"\"),\n",
    "                  c.skill_type = coalesce('{row['SKILLTYPE']}', \"\"),\n",
    "                  c.description = coalesce(\"{row['DESCRIPTION'].replace('\"','')}\", \"\")\n",
    "                \"\"\"\n",
    "                self.run_query(query)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed to process row: {row}, Error: {e}\")\n",
    "                failed_rows.append(row)\n",
    "        return failed_rows\n",
    "\n",
    "    def create_skill_occupation_relation(self, df):\n",
    "        failed_rows = []\n",
    "        for _, row in tqdm(df.iterrows()):\n",
    "            try:\n",
    "                query = f\"\"\"\n",
    "                MATCH (a:Occupation {{key_id: '{row['OCCUPATIONID']}'}}), (b:Skill {{key_id: '{row['SKILLID']}'}})\n",
    "                MERGE (a)-[r:HAS_SKILL]->(b)\n",
    "                SET r.type = '{row['RELATIONTYPE']}'\n",
    "                \"\"\"\n",
    "                self.run_query(query)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed to process row: {row}, Error: {e}\")\n",
    "                failed_rows.append(row)\n",
    "        return failed_rows\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7a4a29bf-599d-4360-a42b-331bfaaf9caf",
   "metadata": {},
   "outputs": [],
   "source": [
    "## ingesting Occupations\n",
    "neo4j_handler = Neo4jHandler(uri, user, password)\n",
    "\n",
    "failed_rows_occupation = neo4j_handler.create_occupation_nodes(occupations)\n",
    "\n",
    "failed_rows_isco_group = neo4j_handler.create_isco_group_nodes(isco_groups) \n",
    "\n",
    "failed_rows_isco_group_hierarchy = neo4j_handler.create_isco_hierarchy(occupations_hierarchy) \n",
    "failed_rows_occupation_isco_hierarchy = neo4j_handler.create_occupation_isco_hierarchy(occupations_hierarchy)\n",
    "failed_rows_occupation_hierarchy = neo4j_handler.create_occupation_hierarchy(occupations_hierarchy)\n",
    "\n",
    "failed_row_skill = neo4j_handler.create_skill_nodes(skills_data)\n",
    "failed_rows_skill_occupation_relation = neo4j_handler.create_skill_occupation_relation(skills_occupations_data)\n",
    "neo4j_handler.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a2bd6576-5cb4-4852-b3ef-fbf66ab76fb8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "ce7b91fc-c9ac-4a24-b24f-b40918c46873",
   "metadata": {},
   "source": [
    "## Vector index creation on skill "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "7ef7bc7e-6989-4ff7-85ab-494a074090af",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.vectorstores.neo4j_vector import Neo4jVector\n",
    "\n",
    "## If OPENAI key is present\n",
    "from langchain.embeddings.openai import OpenAIEmbeddings\n",
    "embeddings = \"text-embedding-3-small\" \n",
    "\n",
    "## If Google API key is present \n",
    "from langchain_google_genai import GoogleGenerativeAIEmbeddings\n",
    "embeddings = GoogleGenerativeAIEmbeddings(model=\"models/embedding-001\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "0d80f71f-80b5-4872-a49a-505edd807dd1",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph_vector_index = Neo4jVector.from_existing_graph(\n",
    "    embedding = embeddings,\n",
    "    url=uri,\n",
    "    username=user,\n",
    "    password=password,\n",
    "    index_name='skills',\n",
    "    node_label=\"Skill\",\n",
    "    text_node_properties=['skill_name','description'],\n",
    "    embedding_node_property='embedding',\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "9158bf3b-0db0-4b1b-8da5-7cbcf34cb390",
   "metadata": {},
   "outputs": [],
   "source": [
    "hr_topics = [\n",
    "    \"Employee relations management\",\n",
    "    \"Recruitment and selection processes\",\n",
    "    \"Performance management systems\",\n",
    "    \"Compensation and benefits administration\",\n",
    "    \"Labor law and employment regulations\",\n",
    "    \"Training and development programs\",\n",
    "    \"Conflict resolution and negotiation skills\"\n",
    "]\n",
    "\n",
    "\n",
    "sales_skills = [\n",
    "    \"Customer relationship management (CRM)\",\n",
    "    \"Sales strategies and techniques\",\n",
    "    \"Negotiation and persuasion\",\n",
    "    \"Product knowledge and presentation\",\n",
    "    \"Market and competitor analysis\",\n",
    "    \"Closing sales and follow-ups\",\n",
    "    \"Communication and interpersonal skills\"\n",
    "]\n",
    "\n",
    "topics = [\n",
    "    \"Financial analysis\",\n",
    "    \"Investment management\",\n",
    "    \"Portfolio management\",\n",
    "    \"Risk management\",\n",
    "    \"Asset allocation\",\n",
    "    \"Equity research\",\n",
    "    \"Fixed income analysis\",\n",
    "    \"Quantitative analysis\",\n",
    "    \"Performance measurement\",\n",
    "    \"Investment strategy development\",\n",
    "    \"Market analysis\",\n",
    "    \"Financial modeling\",\n",
    "    \"Valuation techniques\",\n",
    "    \"Investment selection\",\n",
    "    \"Asset pricing\"\n",
    "]\n",
    "\n",
    "# topics = [\n",
    "#     \"Financial analysis\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "6cfdc8f9-642f-4f50-a6c5-a6ad0130dee6",
   "metadata": {},
   "outputs": [],
   "source": [
    "total_skills = []\n",
    "for skill in topics:\n",
    "    skill_lst = []\n",
    "    result = vector_index.similarity_search(skill, k=3)\n",
    "    skill_lst = [val.page_content.split('\\n')[1].split(':')[-1].strip(' ') for val in result]\n",
    "    total_skills.extend(skill_lst)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "b0d7d65e-f0cb-4feb-b50f-ca8e37e20e68",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['economics',\n",
       " 'follow a brief',\n",
       " 'job market offers',\n",
       " 'risk management',\n",
       " 'manage financial risk',\n",
       " 'manage several projects',\n",
       " 'implement hedging strategies for clients',\n",
       " 'parts pricing',\n",
       " 'monitor stock market',\n",
       " 'make investment decisions',\n",
       " 'monitor bond market',\n",
       " 'market analysis',\n",
       " 'manage commercial risks',\n",
       " 'perform market research',\n",
       " 'market participants',\n",
       " 'meet productivity targets',\n",
       " 'games rules',\n",
       " 'manage securities trading',\n",
       " 'cloud monitoring and reporting',\n",
       " 'operate financial instruments',\n",
       " 'assist in fund management',\n",
       " 'manage profitability',\n",
       " 'advise on investment',\n",
       " 'review investment portfolios',\n",
       " 'perform financial analysis on price strategies',\n",
       " 'analyse experimental laboratory data']"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "total_skills = list(set(total_skills))\n",
    "total_skills\n",
    "\n",
    "# topics = [\n",
    "#     \"Financial analysis\",\n",
    "#     \"Investment management\",\n",
    "#     \"Portfolio management\",\n",
    "#     \"Risk management\",\n",
    "#     \"Asset allocation\",\n",
    "#     \"Equity research\",\n",
    "#     \"Fixed income analysis\",\n",
    "#     \"Quantitative analysis\",\n",
    "#     \"Performance measurement\",\n",
    "#     \"Investment strategy development\",\n",
    "#     \"Market analysis\",\n",
    "#     \"Financial modeling\",\n",
    "#     \"Valuation techniques\",\n",
    "#     \"Investment selection\",\n",
    "#     \"Asset pricing\"\n",
    "# ]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "722be111-047b-47ce-9abc-bc17665bff10",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "neo4j_handler = Neo4jHandler(uri, user, password)\n",
    "occupation_dict = {}\n",
    "non_matched_skills = []\n",
    "for skill in total_skills:\n",
    "    \n",
    "    try:\n",
    "        query = f'''MATCH (s:Skill {{skill_name:'{skill}'}})<-[:HAS_SKILL]-(o:Occupation) RETURN DISTINCT(o.occupation_name)'''\n",
    "        result = neo4j_handler.run_query(query)\n",
    "        occupation_lst = []\n",
    "        occupation_lst = [val['(o.occupation_name)'] for val in result]\n",
    "        \n",
    "        for occupation in occupation_lst:\n",
    "            if occupation in occupation_dict.keys():\n",
    "                occupation_dict[occupation] += 1\n",
    "            elif occupation not in occupation_dict.keys():\n",
    "                occupation_dict[occupation] = 1\n",
    "    except:\n",
    "        non_matched_skills.append(skill)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "609027f9-32fd-465f-9dc3-f84b8e932309",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "human resources manager: 7\n",
      "service manager: 6\n",
      "corporate training manager: 5\n",
      "marketing manager: 5\n",
      "special-interest groups' official: 4\n"
     ]
    }
   ],
   "source": [
    "top_3_jobs = sorted(occupation_dict.items(), key=lambda x: x[1], reverse=True)[:5]\n",
    "\n",
    "# Print the top 3 keys and their values\n",
    "for job, count in top_3_jobs:\n",
    "    print(f\"{job}: {count}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "a2a17661-aa09-41ac-a932-1897fa86e9ee",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = f'''MATCH (o:Occupation{{occupation_name:\"human resources manager\"}}) RETURN DISTINCT(o.description)'''\n",
    "result = neo4j_handler.run_query(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "a1ba338e-d52c-4c06-a681-a96d9a0e049a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'(o.description)': \"human resources managers plan, design and implement processes related to the human capital of companies. they develop programs for recruiting, interviewing, and selecting employees based on a previous assessment of the profile and skills required in the company. moreover, they manage compensation and development programs for the company's employees comprising trainings, skill assessment and yearly evaluations, promotion, expat programs, and general assurance of the well-being of the employees in the workplace.\"}]"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ad5adbe1-a9cb-406c-a17c-2fa84fe94e04",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4ae8b17b-605e-4a6f-b193-76d6082b62f7",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "8a45b104-9198-4b8a-b596-2fb1612f6fac",
   "metadata": {},
   "source": [
    "## Comparing Non-Tech skills"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "76bd39ff-a783-4618-a37e-afc1e2710c17",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import faiss\n",
    "from uuid import uuid4\n",
    "from langchain_google_genai import GoogleGenerativeAIEmbeddings\n",
    "from langchain_community.docstore.in_memory import InMemoryDocstore\n",
    "from langchain_core.documents import Document\n",
    "from langchain_community.vectorstores import FAISS\n",
    "\n",
    "if \"GOOGLE_API_KEY\" not in os.environ:\n",
    "    os.environ[\"GOOGLE_API_KEY\"] = \"AIzaSyDi1T5Lwry7oKpl2htCsfoqfWwEJt4A1BE\"\n",
    "\n",
    "embeddings = GoogleGenerativeAIEmbeddings(model=\"models/embedding-001\")\n",
    "\n",
    "index = faiss.IndexFlatL2(len(embeddings.embed_query(\"hello world\")))\n",
    "\n",
    "faiss_vector_store = FAISS(\n",
    "    embedding_function=embeddings,\n",
    "    index=index,\n",
    "    docstore=InMemoryDocstore(),\n",
    "    index_to_docstore_id={},\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "462c7e16-4a54-4c51-b60e-fbc586b2d7ce",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['5fceef78-3ac5-47c6-b8c2-8542b1661cd8',\n",
       " '117a9e1b-1a81-4561-bc29-e5a05fad31f5',\n",
       " '39412f6e-e51f-40a1-9a0e-b631c3aa7698',\n",
       " 'a39ca2d1-f061-43db-8fa9-14feb0a1c084',\n",
       " 'bedf65e8-4a47-4f1b-8613-752507f245e6',\n",
       " 'f85950a3-cdbc-4cb2-a606-823d350180e6',\n",
       " 'e0a73e10-7709-4c6e-b8b6-e4aa9d060983',\n",
       " 'aaf33c22-4877-4bdf-bb97-55a20f43bfa7',\n",
       " 'cdd07443-859b-4ed5-b36c-e0ad8dedbb9e',\n",
       " '6381e1c6-e604-4bda-a91f-86e2315ea64e',\n",
       " '88307d49-4c2d-46dd-9907-54ca5a428171',\n",
       " '2335f78d-d8f2-45b2-bd80-82e57d22b736',\n",
       " '54ace2bf-919e-4f05-8723-b5319fe6d88a',\n",
       " '93db8c89-ccbc-4bec-98af-3a90a606314d',\n",
       " 'e9e995db-e048-44f0-ad6c-e92260ad152b',\n",
       " '0bdf895f-16e2-4073-9956-e90173609f6f',\n",
       " 'e47b3037-703f-455c-9253-109c5f3117ce',\n",
       " 'c8049fb9-fec8-43f2-a08b-7dff766afcee',\n",
       " '8d83d16c-6e38-41cb-8065-7bafaed2febf',\n",
       " '4e60471e-c781-4e22-b227-9758f2ecfbd2',\n",
       " '3dc4ae99-3e31-4db4-8415-67ea9688c879',\n",
       " 'bab56166-e5b1-4060-92d7-1f4073c8504e',\n",
       " '95d73d65-5892-4259-8717-28876f763f02',\n",
       " '0e413d13-55b2-4695-bae6-e46085bedf29',\n",
       " '8439a0f3-e9ae-4f2e-90d9-e8866f80ce78',\n",
       " '787462d2-b238-4a23-9af5-c7f744e7aa1e',\n",
       " 'aca655bc-90b0-4875-afc3-c9c4b086cd27',\n",
       " '009bdf1a-fb6a-499e-b7d1-fb093354b639',\n",
       " 'c19e1b7d-0860-4001-904a-3096aa9e76fc',\n",
       " '4492d0da-7d16-479c-b6f3-dff7b19b1afd',\n",
       " '24a0a0de-1a12-4844-96fd-5578ab1edeef',\n",
       " 'f3bebe14-0222-416f-8e13-c62b528508b9',\n",
       " '359ef7c3-59fa-40ce-b425-bc0419d74229',\n",
       " '679016ef-bb54-4598-ac9e-f4b203abd8c5']"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "documents = [Document(page_content=val) for val in total_skills]\n",
    "uuids = [str(uuid4()) for _ in range(len(documents))]\n",
    "\n",
    "faiss_vector_store.add_documents(documents=documents, ids=uuids)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "4754a12b-6c49-4855-b8f8-d02153054c73",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " market analysis , Score: 0.126280\n",
      " market participants , Score: 0.136373\n"
     ]
    }
   ],
   "source": [
    "results = faiss_vector_store.similarity_search_with_score(\n",
    "    \"perform market \", k=2\n",
    ")\n",
    "for res, score in results:\n",
    "    print(f\" {res.page_content} , Score: {score:3f}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "bba9be72-ba14-42af-a883-f803ef753d41",
   "metadata": {},
   "outputs": [],
   "source": [
    " skills_lst_1  = [\n",
    "    \"Financial analysis\",\n",
    "    \"Investment management\",\n",
    "    \"Portfolio management\",\n",
    "    \"Risk management\",\n",
    "    \"Asset allocation\",\n",
    "    \"Equity research\",\n",
    "    \"Fixed income analysis\",\n",
    "    \"Quantitative analysis\",\n",
    "    \"Performance measurement\",\n",
    "    \"Investment strategy development\",\n",
    "    \"Market analysis\",\n",
    "    \"Financial modeling\",\n",
    "    \"Valuation techniques\",\n",
    "    \"Investment selection\",\n",
    "    \"Asset pricing\"\n",
    "]\n",
    "\n",
    "skills_lst_2 = [\n",
    "    \"Financial analysis\",\n",
    "    \"Investment management\",\n",
    "    \"Risk management skills\",\n",
    "    \"Asset allocation\",\n",
    "    \"Equity research\",\n",
    "    \"Quantitative analysis expert\",\n",
    "    \"Investment strategy development\",\n",
    "    \"Market analysis\",\n",
    "    \"expert in Financial modeling\",\n",
    "    \"Good in Valuation techniques\",\n",
    "    \"Asset pricing\"\n",
    "]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "36e5daca-5baa-43ba-8a69-094ee4d750da",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import faiss\n",
    "from uuid import uuid4\n",
    "from langchain_google_genai import GoogleGenerativeAIEmbeddings\n",
    "from langchain_openai import OpenAIEmbeddings\n",
    "from langchain_community.docstore.in_memory import InMemoryDocstore\n",
    "from langchain_core.documents import Document\n",
    "from langchain_community.vectorstores import FAISS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "1da72d05-7e9b-48a5-b14d-b86b2f8819dc",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "\n",
    "def expand_skill_lst(skill_lst):\n",
    "    expanded_skill_lst = []\n",
    "    for skill in skills_lst_1:\n",
    "        skill_lst = []\n",
    "        result = vector_index.similarity_search(skill, k=4)\n",
    "        skill_lst = [val.page_content.split('\\n')[1].split(':')[-1].strip(' ') for val in result]\n",
    "        total_skills.extend(skill_lst)\n",
    "\n",
    "    expanded_skill_lst = list(set(total_skills))\n",
    "    return expanded_skill_lst\n",
    "\n",
    "expanded_skill_lst_1 = expand_skill_lst(skills_lst_1)\n",
    "expanded_skill_lst_2 = expand_skill_lst(skills_lst_2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "71a77ac2-b578-46dd-9ccb-42094b420ed4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "17   17\n"
     ]
    }
   ],
   "source": [
    "numerator_count = 0\n",
    "denominator_count = 0\n",
    "for skill_1 in expanded_skill_lst_1:\n",
    "    if skill_1 in expanded_skill_lst_2:\n",
    "        numerator_count += 1\n",
    "        denominator_count += 1\n",
    "        expanded_skill_lst_1.remove(skill_1)\n",
    "        expanded_skill_lst_2.remove(skill_1)\n",
    "        continue\n",
    "\n",
    "print(numerator_count,' ',denominator_count)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "c4a57903-013e-417d-86b0-675ab0eed3fa",
   "metadata": {},
   "outputs": [],
   "source": [
    "def score_normalizer(val: float) -> float:\n",
    "    return 1 - 1 / (1 + np.exp(val))\n",
    "\n",
    "##using google_api\n",
    "def faiss_index_constructor(skill_lst):\n",
    "    \n",
    "    if \"GOOGLE_API_KEY\" not in os.environ:\n",
    "        os.environ[\"GOOGLE_API_KEY\"] = \"AIzaSyDi1T5Lwry7oKpl2htCsfoqfWwEJt4A1BE\"\n",
    "    \n",
    "    embeddings = GoogleGenerativeAIEmbeddings(model=\"models/embedding-001\")\n",
    "    \n",
    "    # index = faiss.IndexFlatL2(len(embeddings.embed_query(\"hello world\")))\n",
    "    \n",
    "    faiss_vector_store = FAISS(\n",
    "        embedding_function=embeddings,\n",
    "        index=index,\n",
    "        docstore=InMemoryDocstore(),\n",
    "        index_to_docstore_id={},\n",
    "    )\n",
    "\n",
    "    documents = [Document(page_content=val) for val in total_skills]\n",
    "    uuids = [str(uuid4()) for _ in range(len(documents))]\n",
    "    print(documents)\n",
    "    faiss_vector_store.add_documents(documents=documents, ids=uuids)\n",
    "\n",
    "    return faiss_vector_store\n",
    "\n",
    "##using openAI\n",
    "def faiss_index_constructor(skill_lst):\n",
    "    \n",
    "    if \"OPENAI_API_KEY\" not in os.environ:\n",
    "        os.environ[\"OPENAI_API_KEY\"] = \"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\"\n",
    "    \n",
    "    embeddings = OpenAIEmbeddings(model=\"text-embedding-3-large\")\n",
    "\n",
    "    \n",
    "    index = faiss.IndexFlatL2(len(embeddings.embed_query(\"hello world\")))\n",
    "    \n",
    "    faiss_vector_store = FAISS(\n",
    "        embedding_function=embeddings,\n",
    "        index=index,\n",
    "        docstore=InMemoryDocstore(),\n",
    "        index_to_docstore_id={},\n",
    "        relevance_score_fn=score_normalizer,\n",
    "    )\n",
    "\n",
    "    documents = [Document(page_content=val) for val in total_skills]\n",
    "    uuids = [str(uuid4()) for _ in range(len(documents))]\n",
    "    faiss_vector_store.add_documents(documents=documents, ids=uuids)\n",
    "\n",
    "    return faiss_vector_store"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "97574906-1c9b-4154-9cb5-ff76b23ca2df",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "fce7b478-8545-4d38-939b-435dd0d3a27e",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "faiss_vector_store = faiss_index_constructor(expanded_skill_lst_1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "8f12a530-2b38-453f-ae91-efbf5b65ede1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "('manage several projects', 1.8191947e-06)"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def retrieve_from_faiss(skill_name):\n",
    "    def score_normalizer(val: float) -> float:\n",
    "        return 1 - 1 / (1 + np.exp(val))\n",
    "\n",
    "    \n",
    "    results = faiss_vector_store.similarity_search_with_score(\n",
    "        skill_name, k=1\n",
    "    )\n",
    "    for res, score in results:\n",
    "        matched_skill = res.page_content\n",
    "        score = score\n",
    "\n",
    "    return matched_skill,score\n",
    "\n",
    "retrieve_from_faiss('manage several projects')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "20620f64-9c0f-4fa9-91c7-4cfafe40ceb2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['financial engineering',\n",
       " 'job market offers',\n",
       " 'risk management',\n",
       " 'manage several projects',\n",
       " 'implement hedging strategies for clients',\n",
       " 'monitor stock market',\n",
       " 'monitor bond market',\n",
       " 'market analysis',\n",
       " 'training  subject expertise',\n",
       " 'market participants',\n",
       " 'manage securities trading',\n",
       " 'provide support in financial calculation',\n",
       " 'operate financial instruments',\n",
       " 'advise on investment',\n",
       " 'perform financial analysis on price strategies',\n",
       " 'similitude',\n",
       " 'stock market']"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "expanded_skill_lst_1"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "414f7831-b697-49e3-aee1-01ca63d866f9",
   "metadata": {},
   "source": [
    "## Using FAISS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "f0de394e-dc10-42e4-bbba-f3e40c6dacd2",
   "metadata": {},
   "outputs": [],
   "source": [
    "import faiss\n",
    "import numpy as np\n",
    "from sklearn.preprocessing import normalize\n",
    "from langchain.embeddings import OpenAIEmbeddings\n",
    "import pickle \n",
    "\n",
    "embeddings_model = OpenAIEmbeddings(model=\"text-embedding-3-large\")\n",
    "\n",
    "def get_openai_embeddings(texts):\n",
    "    embeddings = embeddings_model.embed_documents(texts)\n",
    "    return np.array(embeddings)\n",
    "\n",
    "\n",
    "def build_faiss_index(index_list):\n",
    "    index_vectors = get_openai_embeddings(index_list)\n",
    "    \n",
    "    # Normalize vectors to use cosine similarity\n",
    "    index_vectors = normalize(index_vectors, norm='l2')\n",
    "    \n",
    "    dimension = index_vectors.shape[1]  \n",
    "    index = faiss.IndexFlatIP(dimension)  # Using Inner Product (IP) for cosine similarity\n",
    "    index.add(index_vectors)  # Add index vectors to the FAISS index\n",
    "    \n",
    "    return index\n",
    "\n",
    "def save_index_to_memory(faiss_index):\n",
    "    return faiss.serialize_index(faiss_index)\n",
    "\n",
    "def load_index_from_memory(serialized_index):\n",
    "    return faiss.deserialize_index(serialized_index)\n",
    "\n",
    "def fetch_top_k_results(faiss_index, index_list, query, k=5):\n",
    "    query_vector = get_openai_embeddings([query])[0].reshape(1, -1)  \n",
    "    \n",
    "    query_vector = normalize(query_vector, norm='l2')\n",
    "    \n",
    "    distances, top_indices = faiss_index.search(query_vector, k)  \n",
    "    top_results = [(index_list[i], float(dist)) for i, dist in zip(top_indices[0], distances[0])]\n",
    "    \n",
    "    return top_results\n",
    "\n",
    "index_list = skills_lst_1\n",
    "\n",
    "faiss_index = build_faiss_index(index_list)\n",
    "serialized_index = save_index_to_memory(faiss_index)\n",
    "\n",
    "loaded_faiss_index = load_index_from_memory(serialized_index)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "8af2db79-ecea-44bd-969f-71e647c6ee00",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[('Risk management', 0.8069169521331787), ('Portfolio management', 0.4653838574886322), ('Investment management', 0.4617082476615906)]\n"
     ]
    }
   ],
   "source": [
    "query = \"Risk management skills\"\n",
    "k = 3  \n",
    "\n",
    "results = fetch_top_k_results(loaded_faiss_index, index_list, query, k)\n",
    "print(results)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "458652bf-6829-49c0-b9c1-93cfa57048fd",
   "metadata": {},
   "outputs": [],
   "source": [
    "skills_company  = [\n",
    "    \"Financial analysis\",\n",
    "    \"Investment management\",\n",
    "    \"Portfolio management\",\n",
    "    \"Risk management\",\n",
    "    \"Asset allocation\",\n",
    "    \"Equity research\",\n",
    "    \"Fixed income analysis\",\n",
    "    \"Quantitative analysis\",\n",
    "    \"Performance measurement\",\n",
    "    \"Investment strategy development\",\n",
    "    \"Market analysis\",\n",
    "    \"Financial modeling\",\n",
    "    \"Valuation techniques\",\n",
    "    \"Investment selection\",\n",
    "    \"Asset pricing\"\n",
    "]\n",
    "\n",
    "skills_candidate_1 = [\n",
    "    \"Financial analysis\",\n",
    "    \"Investment management\",\n",
    "    \"Risk management skills\",\n",
    "    \"Asset allocation\",\n",
    "    \"Equity research\",\n",
    "    \"Quantitative analysis expert\",\n",
    "    \"Investment strategy development\",\n",
    "    \"Market analysis\",\n",
    "    \"expert in Financial modeling\",\n",
    "    \"Good in Valuation techniques\",\n",
    "    \"Asset pricing\"\n",
    "]\n",
    "\n",
    "skills_candidate_2 = [\n",
    "    \"Financial analysis\",\n",
    "    \"Investment management\",\n",
    "    \"Risk management skills\",\n",
    "    \"Asset allocation\",\n",
    "    \"Quantitative analysis expert\",\n",
    "    \"Investment strategy development\",\n",
    "    \"Market analysis\",\n",
    "    \"Good in Valuation techniques\",\n",
    "    \"Asset pricing\"\n",
    "]\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
